       IDENTIFICATION                  DIVISION.
       PROGRAM-ID.INVOICE-PROG.
      *================================================================*
      *    AUTHOR      : NATAN BOANAFINA.                              *
      *    ENTERPRISE  : NOT APPLICABLE                                *
      *    PROFESSOR   : IVAN PETRUCCI                                 *
      *    DATE        : 23/11/2022                                    *
      *                                                                *
      *----------------------------------------------------------------*
      *    PURPOSE     : SEARCH FOR CLIENTS VIA ID, SAVE THEIR GOODS   *
      *    BOUGHT INTO A NEW FILE AND SHOW IT UP.                      *
      *                                                                *
      *----------------------------------------------------------------*
      *    FILES       :                                               *
      *    DDNAME                 I/O                 COPY/BOOK        *
      *    CLIENTS                 I                      -            *
      *    SHOPPING                I                      -            *
      *    INVOICE                 O                      -            *
      *----------------------------------------------------------------*
      *================================================================*
       ENVIRONMENT                     DIVISION.
      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

      *----------------------------------------------------------------*
       INPUT-OUTPUT                    SECTION.
       FILE-CONTROL.
      *================================================================*
      *----------------------------------------------------------------*
       DATA                            DIVISION.
       FILE                            SECTION.
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*
       01  FILLER          PIC X(047) VALUE
           "========== WORKING-STORAGE BEGINNING ==========".
      *================================================================*
      *----------------------------------------------------------------*
      *================================================================*
       PROCEDURE                       DIVISION.
      *----------------------------------------------------------------*
           PERFORM 0100-INIT.
           PERFORM 0200-PROCESS.
           PERFORM 0300-END.
      *----------------------------------------------------------------*
       0100-INIT                       SECTION.
           CONTINUE.
      *----------------------------------------------------------------*
       0200-PROCESS                    SECTION.
           CONTINUE.
      *----------------------------------------------------------------*
       0300-END                        SECTION.
           STOP RUN.
      *----------------------------------------------------------------*
      *================================================================*
